{"meta":{"title":"寒月轩的博客","subtitle":null,"description":"心若冰清，天塌不惊","author":"寒月轩","url":"http://yoursite.com"},"pages":[{"title":"","date":"2017-04-17T12:39:24.422Z","updated":"2017-04-17T12:39:24.422Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":"title: tags date: 2017-04-17 20:38:33"},{"title":"","date":"2017-04-17T12:40:35.052Z","updated":"2017-04-17T12:40:35.052Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":"title: categories date: 2017-04-17 20:40:04"}],"posts":[{"title":"计算机基础知识（二）","slug":"计算机基础知识（二）","date":"2017-02-17T12:51:37.000Z","updated":"2017-02-17T13:05:11.540Z","comments":true,"path":"2017/02/17/计算机基础知识（二）/","link":"","permalink":"http://yoursite.com/2017/02/17/计算机基础知识（二）/","excerpt":"每日一句 You laugh at me for being different,but I laugh at you for being the same.你嘲笑我和别人不一样，我嘲笑你和大家都一样。","text":"每日一句 You laugh at me for being different,but I laugh at you for being the same.你嘲笑我和别人不一样，我嘲笑你和大家都一样。","categories":[],"tags":[{"name":"web","slug":"web","permalink":"http://yoursite.com/tags/web/"},{"name":"计算机","slug":"计算机","permalink":"http://yoursite.com/tags/计算机/"},{"name":"基础知识","slug":"基础知识","permalink":"http://yoursite.com/tags/基础知识/"},{"name":"计算机基础知识","slug":"计算机基础知识","permalink":"http://yoursite.com/tags/计算机基础知识/"},{"name":"技术人员应该知道的一些知识","slug":"技术人员应该知道的一些知识","permalink":"http://yoursite.com/tags/技术人员应该知道的一些知识/"}]},{"title":"计算机基础知识（一）","slug":"计算机基础知识（一）","date":"2017-02-16T12:51:37.000Z","updated":"2017-04-18T10:51:57.979Z","comments":true,"path":"2017/02/16/计算机基础知识（一）/","link":"","permalink":"http://yoursite.com/2017/02/16/计算机基础知识（一）/","excerpt":"每日一句 Life is like angry birds. There are always several pigs laughing when you lose.人生就像愤怒的小鸟，当你失败时，总有几头猪在笑！","text":"每日一句 Life is like angry birds. There are always several pigs laughing when you lose.人生就像愤怒的小鸟，当你失败时，总有几头猪在笑！ 一、 计算机概述 电子计算机的发展 世界上第一太名为“ENIAC”的数字电子计算机于1946年诞生在美国宾夕法尼亚大学，半个世纪的发展中，计算机总过经历了4个时代。 第一代，在1946年到1958年之间，此时的计算机采用电子管作为计算机的逻辑元件，运行速度每秒仅仅只有几千次，内存容量也仅仅只有几KB。并且多数用于军事和科研中的科学计算；用机器语言或者汇编语言编写程序。其中的代表机型有，IBM 650、IBM709等。 第二代，在1958年到1964年之间，这时候的计算机采用晶体管作为计算机的逻辑元件，运算速度每秒达几十万次，内存容量扩大到了几十KB。而且用途也从科学计算扩展到了数据处理和自动控制中，同时也出现了FORTRAN等高级语言。其中的代表机型有，IBM7094、CDC7600等。 第三代，在1964年到1970年之间，第三代的计算机已经开始使用集成电路作为计算机的逻辑元件，运算速度每秒达几十万至几百万次。此时的计算机的用途已经不仅仅局限于数据处理和自动控制，它已经开始广泛应用与各个领域；高级语言有了很大发展，并出现了操作系统和会话式语言。代表机型有IBM360等。 第四代，从1971年一直到现在，计算机开始使用大规模和超大规模的集成电路作为计算机的逻辑元件，运算速度每秒达几千万至十万亿次，应用范围也早已经渗透到各行各业，并进入了以网络为特征的时代；操作系统不断完善，应用软件已经彻彻底底成为了现代工业的一部分。至于代表机型就不一一列举了。 微型计算机的发展 1971年由美国Intel公司的工程师马西安·霍夫（M·E·Hoff）设计了世界上第一台名为MCS-4的4位微型计算机。这台机子是由一片4位微处理Intel、一片320位（40字节）的随机存取存储器、一片256字节的只读存储器和一片10位的寄存器通过总线连接起来的。 而微处理器也如同计算机一样有四代历程，但是它的前三代相对于计算机而言短的多了。 第一代，在1972年，第一代（8位）的微处理器，代表产品是Intel 8008； 第二代，在第一代出现的第二年，也就是1973年，第二代（同样是8位）的微处理器问世，代表产品是Intel 8085； 第三代，又过了五年之后，第三代（16位）的微处理器出现，代表产品是Intel 8086； 第四代，在1985年，产品Intel 80386问世，1993年，产品Pentium问世，1995年，产品Pentium Pro问世，1997年，产品Pentium II问世，1999年产品Pentium III问世，自此便是微型计算机的全部历程。 计算机的分类 计算机的分类大致分为：巨型计算机、小巨型机、大型机、小型计算机、工作站、个人计算机这6类，其中巨型计算机和小巨型机可以用作系统的服务器，而大型计算机和小型计算机可以用作部门的服务器，最后的工作站和个人计算机则是用作客户机。 计算机的应用 （1） 科学计算如：计算量大、数值变化范围大的天文学、空气动力学、量子化学、核物理学和天气预报等领域中的复杂运算； （2） 数据处理是计算机应用的一个重要方面，比如：办公自动化、企业管理、事务管理、情报检索等非数值计算的领域； （3） 过程控制比如：冶金、石油、化工、纺织、水电、机械、航天等现代工业生产过程中的自动化控制； （4） 计算机辅助系统计算机辅助设计 CAD： 如飞机、船舶、建筑、机械、大规模集成电路等的设计； 计算机辅助制造 CAM： 用计算机进行生产设备的管理、控制和操作； 计算机辅助教育 CBE： 如计算机辅助教学CAI、计算机辅助测试CAT、计算机管理教学CMI； （5） 人工智能 AI是计算机应用研究的前沿学科； （6） 信息高速公路（“国家信息基础设施”的俗称）我国已建立的大型计算机应用工程-“金”字工程： 金桥工程（全国经济信息网） 金卡工程（金融信息网） 金关工程（外贸海关信息网） 金智工程（教育科研信息网） （7） 电子商务利用国际互联网Internet 进行网上商务活动，始于1996年，现在已经发展迅速，全球现在已经有许多企业先后开展了“电子商务”活动。","categories":[],"tags":[{"name":"web","slug":"web","permalink":"http://yoursite.com/tags/web/"},{"name":"计算机","slug":"计算机","permalink":"http://yoursite.com/tags/计算机/"},{"name":"基础知识","slug":"基础知识","permalink":"http://yoursite.com/tags/基础知识/"},{"name":"计算机基础知识","slug":"计算机基础知识","permalink":"http://yoursite.com/tags/计算机基础知识/"},{"name":"技术人员应该知道的一些知识","slug":"技术人员应该知道的一些知识","permalink":"http://yoursite.com/tags/技术人员应该知道的一些知识/"}]},{"title":"传说中的完美继承，666","slug":"传说中的完美继承，666+","date":"2017-02-15T13:41:15.000Z","updated":"2017-02-17T12:59:16.804Z","comments":true,"path":"2017/02/15/传说中的完美继承，666+/","link":"","permalink":"http://yoursite.com/2017/02/15/传说中的完美继承，666+/","excerpt":"每日一句 Be yourself,don’t change for anyone.If they dont’t like you at your worst,then they don’t deserve you at your best.勇敢的做自己，不要为任何人而改变。如果他们不能接受最差的你，也不配拥有最好的你。","text":"每日一句 Be yourself,don’t change for anyone.If they dont’t like you at your worst,then they don’t deserve you at your best.勇敢的做自己，不要为任何人而改变。如果他们不能接受最差的你，也不配拥有最好的你。 一、引言 走自己的路，让别人去说吧；走别人的路，让别人无路可走。哈哈，然而我还是太善良了，还给别人剩了一双鞋，没有把别人的鞋也穿走！ 二、技术 今天的是传说中完美继承，666+！###function extend(fatherProto,sonProto){ for(var item in fatherProto){ sonProto[item] = fatherProto[item]; } } 三、结语 学习使我快乐，哈哈！","categories":[],"tags":[{"name":"web","slug":"web","permalink":"http://yoursite.com/tags/web/"},{"name":"完美继承","slug":"完美继承","permalink":"http://yoursite.com/tags/完美继承/"},{"name":"原型","slug":"原型","permalink":"http://yoursite.com/tags/原型/"},{"name":"object","slug":"object","permalink":"http://yoursite.com/tags/object/"},{"name":"函数","slug":"函数","permalink":"http://yoursite.com/tags/函数/"}]},{"title":"关于数组去重的案例","slug":"关于数组去重的案例","date":"2017-02-14T11:20:42.000Z","updated":"2017-02-17T12:58:23.156Z","comments":true,"path":"2017/02/14/关于数组去重的案例/","link":"","permalink":"http://yoursite.com/2017/02/14/关于数组去重的案例/","excerpt":"每日一句 If you fall in love with your Mr Right,every day is like Valentine’s Day.其实爱对了人，每天都是情人节。","text":"每日一句 If you fall in love with your Mr Right,every day is like Valentine’s Day.其实爱对了人，每天都是情人节。 一、引言 今天2月14日，情人节，就连金山词霸都在过情人节，不过这句话说的确实也对，爱对了人，每天都是情人节，爱错了人，每天都是愚人节。今天主要是关于数组去重的一些技术分享，可能略有瑕疵，希望各位能够与博主共勉，感谢各位。 二、技术 第一篇是关于如何输出数组中最小的数字的方法。首先定义了一个数组，数组中随便放了一些数字，然后定义了一个 num ，当然，这个 num 的值并不是固定的，任何一个数字都是可以的。再接下来就是通过for循环去遍历数组了，在遍历数组的时候用定义的 num 与数组中的每一个数字进行比较，如果大于数组中的这个数字，那么就把 num 重新定义为这个数字，这样就能将数组中最小的那个数字输出了，代码如下：var arr = [1,121,2,5,5,6,8,50,0,0]; var num = arr[0]; for(var j = 0; j &lt; arr.length - 1; j++) { (function (a) { if(num &gt; arr[a]) { num = arr[a]; } })(j) } console.log(num);第二篇是关于如何找到字符串中出现次数最多的字母，并且将它出现的次数记录并输出的方法。首先同样是定义了一个字符串 str ，然后又定义了一个空的对象 obj ，通过for循环将字符串中的字符依次输出，并且计算出他们出现的次数，然后通过for in利用上一篇比较大小的原理将二者输出即可，代码如下：var str = &#39;aaabaabb&#39;; var obj = {}; for(var i = 0; i &lt; str.length; i++){ var k = str.charAt(i); if(obj[k]) { obj[k]++; }else { obj[k] = 1; } } var m=0; var i=null; for(var k in obj){ if(obj[k] &gt; m){ m = obj[k]; i = k; } } console.log(i+&#39;:&#39;+m); 结语 2月14日这个甜蜜的日子，愿你的身边都是那个对的ta！祝大家情人节快乐~","categories":[],"tags":[{"name":"web","slug":"web","permalink":"http://yoursite.com/tags/web/"},{"name":"技术","slug":"技术","permalink":"http://yoursite.com/tags/技术/"},{"name":"数组去重","slug":"数组去重","permalink":"http://yoursite.com/tags/数组去重/"},{"name":"出现最多的字符","slug":"出现最多的字符","permalink":"http://yoursite.com/tags/出现最多的字符/"},{"name":"最小的数字","slug":"最小的数字","permalink":"http://yoursite.com/tags/最小的数字/"}]},{"title":"展望2017","slug":"展望2017","date":"2017-01-29T06:20:06.000Z","updated":"2017-02-19T23:52:14.530Z","comments":true,"path":"2017/01/29/展望2017/","link":"","permalink":"http://yoursite.com/2017/01/29/展望2017/","excerpt":"导语 计划像一座桥，连结我们现在所处的位置和你想要去的地方。同样的，计划是连结目标与目标之间的桥梁，也是连结目标和行动的桥梁。没有计划，实现目标往往可能是一句空话。计划对于人生来说相当重要，如果你在计划上失败了，那你注定会在执行上失败。没有计划的人生杂乱无章，看似忙碌却是空缺的。","text":"导语 计划像一座桥，连结我们现在所处的位置和你想要去的地方。同样的，计划是连结目标与目标之间的桥梁，也是连结目标和行动的桥梁。没有计划，实现目标往往可能是一句空话。计划对于人生来说相当重要，如果你在计划上失败了，那你注定会在执行上失败。没有计划的人生杂乱无章，看似忙碌却是空缺的。 主体内容 一、引言 今年我二十岁，是一名大二学生，我的青春慢慢地将要变成回忆，我希望自己在迈出大学的门槛时无需频频回首，自信而坚定，双手捧满了收获的果实，因而，谨在此制定一个一年半年计划，努力让青春的遗憾少一些、再少一些。 二、自我期许 拥有持之以恒的毅力；对自己有足够的自觉，善待他人；能够学以致用回报社会；每天自我反省；拥有健康的体魄和温柔、坚定的心； 三、计划书简介 此计划书从2017年二月起至2018年6月止为期一年半，主要分为三部分：一是自身修养的提高与完善，二是技能的加强与学习，三是身体素质的增强，这三部分学习将贯穿整个一年半的学习之中。 四、主要学习内容 （一）、自身修养的提高 自身修养的提高可以使得交际更加的轻松，更是对于自身成长的一个最直观的表现方式。 从思想深处改善要从思想深处认识到自己的缺点，在细小的细节处注意，只有从思想深处认识到自己的缺点才能完善的从最本质的改善自己。 从细节着手没有素质其实也体现在很多的细节方面，所以要在日常生活中要把小细节做好。比如不再公众场合抽烟，不在马路上随地吐痰，看到有帮助的人们要积极的伸出友善之手。 改变谈吐没有素质的还表现在说话的谈吐上面，所以说这也是我们要注意的一点。比如不再公众场合大声喧哗，和人交谈时候要面带微笑。我们也可以让自己的语言变得幽默风趣一些，在闲暇的时候可以看看散文或者诗歌，也可以了解一下国际新闻。扩大自身的知识面，让自己的话语变得丰富有趣。 不乱发脾气没有一个人会喜欢一个随时乱发脾气的人，也没有人会喜欢一个性格暴躁的人，所以说要培养自己的性格，争取不要乱发脾气。 做一个真诚的人没有人会喜欢一个虚伪的人，及时你说话再得体，再幽默，那么表现的虚伪也会没有人和你真心的接近的。所以说要做一个善良真诚的人，把自己的快乐无私的和家人和朋友分享。 修养不是一天就能拥有的，需要长时间的养成，所以这一部分的学习必须长期的坚持下去，成为一种常态化的培养。 （二）、技能的加强与学习 知识改变命运，这是一句永恒的真理，在当下更是如此。 自我学习能力这种能力是作为学生我们首先要具备的，大学的生活想对比较开放，没有升学压力的束缚，有更多的自由时间，那么我们就有必要给自己设定一个可行的学习计划，并且通过自己的自觉自律来实行这个学习计划。 信息处理能力这里的信息处理能力是多方面的涉及：一是可以利用网络去积极了解社会中的一些对自己有用的信息，比如：如果自己想去一个陌生的城市，可以先利用电子地图了解一下详细的交通情况，然后在利用谷歌地图了解一下三维的城市面貌，通过这些其实一个城市已经基本了解了，下了火车基本上要怎么走脑子里已经有了影像。如果想交一些与自己专业相关的朋友，可以通过博客查询一些人员资料，然后通过他们的日志内容，相片，自我介绍，以及相关的博友判断这个人是否能成为我的朋友，是否对未来的就业有帮助。通过网络也可以在就业之前就知道了自己想去的单位的领导名字、个人爱好、相貌，同时也在这个单位找到了一个QQ好友。二是可以利用网络去学习，去提高自身的技能水平，并且从中吸取对自身成长有益的经验等。 数字应用能力在参加工作之后无论是什么工作我们都会和数字想联系，良好的数字应用能力，能提高在面对问题时的敏感度，以及做出决定的正确率，这种能力表现就是思维敏捷、语言表达能力强，这是未来成为精英的基础。 与人交流能力说话时不应用俗语，常用俗语会妨碍在语言方面的自如运用。要做到尽量多用数字。说话时多用数字，语言会更加生动说服力强，自己也会更加自信。多看电视。电视是最感性的语言来源，但要注意：不要只看电视剧，而应该多看那些咨询性及访谈性节目，这样能让你更好地学习别人的交谈技巧。训练目标感。说话要有的放矢，这就好像走路一样，要有方向性的选择，这种“选择”可以使你在说话中避免漫无边际的东拉西扯。学一些新语言。在日常的工作、学习中，经常学习和吸收一些新的语言，能够更好地丰富你的语言词汇。培养探究精神。在学习和工作过程中，要做到：要么不做，要做就做好，并不断探索生活中的各种规律。做什么事都要既知其然，还要知其所以然。训练判断力。这种能力对于语言来说是至关重要的。在与别人交谈时，如果自己判断失误，就可能做出意思相反的回答，这就很可能导致不必要的误会越来越深。多说有力量的话。有力量的话就是指说话时能够直截了当，行就是行，不行就是不行。不要说“我看……”“我想……”，而应该尽量说“我认为……”这样说话才够力量。多与人交谈。扩大社交圈子，不断增加自己的说话机会，这样更有利于提高自己对语言的驾驭能力。提高语商应具备六大能力 要想提高自己的语商，成为语商很高的语言天才，还应具有以下六大能力。听的能力，听是说的基础。要想会说，养成爱听、多听、会听的好习惯，如多听新闻、听演讲、听别人说话等，这样你就可以获取大量、丰富的信息。这些信息经过大脑的整合、提炼，就会形成语言智慧的丰富源泉。培养听的能力，为培养说的能力打下坚实的基础。看的能力，多看可以为多说提供素材和示范。可以看电影、书报、电视中语言交谈多的节目，还可以看现实生活中各种生动而感人的场景。这些方式一方面可以陶冶情操、丰富文化生活，另一方面又可以学习其他人的说话方式、技巧和内容。特别是那些影视、戏剧、书报中人物的对话，它们源于生活、高于生活，可以为学习说话提供范例。背的能力，背诵不但可以强化记忆，还能训练形成良好的语感。多背诗词、格言、谚语等，它们的内涵丰富、文字优美。如果背的多了，不仅会在情感上受到滋润、熏陶，还可以慢慢形成自己正确而生动的语言。想的能力，想是让思维条理化的必由之路。在现实生活中，很多时候我们不是不会说，而是不会想，想不明白也就说不清楚。在说一件事、介绍一个人之前，认真想想事情发生的时间、地点和经过，想一想人物的外貌、特征等。有了比较条理化的思维，才会让自己的语言更加条理化。编的能力，会编善说是想像力丰富、创造力强的标志。养成善于编写的好习惯，这对提高语言思考和说话能力有着积极的作用。说的能力，说是语言表达能力的最高体现。只有多说，语商能力才会迅速提高。 与人合作能力在未来的工作岗位中不可避免的要与同事共同协作完成相关的工作，这就需要自己具有与人合作的能力，这种能力需要积极锻炼自己的忍耐力。 解决问题能力在今后的学习生活中不可避免的要面对各种困难，在遇到困难时控制自己的心情，哭泣、烦闷并不能解决问题，在纷繁的问题面前要理清条理逐步解决。解决问题的能力重要的是学会控制心情，理清问题的解决思路。 自身技能的提高温故而知新，在今后的学习生活中，不只是要学习新的知识，更重要的是要温习自己曾经学过的知识，每天睡前回忆一下当天所学，并且定期将之前学过的知识重新温习。在学习中要持着“达者为师“的心态去学习，面对学习上的问题要诚恳，会就是会，不会就是不会，不耻下问。 在这样一个变革的时代，职场中人时时刻刻注重提高自身的素质，无论实在外资企业、民营企业，还是国有企业工作，都不仅仅是打一份工。 （三）、身体素质的增强 每个人都想拥有一个很好的身体，毕竟身体才是革命的本钱嘛！ 早睡早起，保证6-7小时的睡眠 起床一杯水，每天需要不觉得渴 适当的运动，适合自己最重要 饮食得当，不要暴饮暴食 情绪放松，保持一个良好的心情 健康是人生最大的财富，有了健康就有了希望，有了希望就有了一切。 五、常态性学习 阅读：每月至少读一本书。英文：金山词霸中的每日一句，可以记录发布到博客上。随时加入其它学习。 六、各阶段目标 2017年六月以前将自身综合能力提高到能够参加工作的能力。 2017年九月以前必须学会一门新的计算机语言。 2017年十二月之前必须拿到计算机等级二级证书。 2018年三月之前必须考过英语四级考试。 2018年六月之前必须学会第二门新的计算机语言。 七、备注 在学习的过程中要持之以恒，切忌偷懒，并随时修改不切实际之处，使计划得以完善。 结语 一年半之后，当我迈出大学，再次翻开这一计划书的时候，希望我能自豪地说：“我的自学之路是永无止境的，虽然前面的目标已完成，但我将再次起航规划以后的道路。”","categories":[],"tags":[{"name":"未来展望","slug":"未来展望","permalink":"http://yoursite.com/tags/未来展望/"},{"name":"计划","slug":"计划","permalink":"http://yoursite.com/tags/计划/"},{"name":"2017计划","slug":"2017计划","permalink":"http://yoursite.com/tags/2017计划/"}]},{"title":"2016年度技术总结","slug":"2016年度技术总结","date":"2017-01-28T11:42:21.000Z","updated":"2017-01-29T11:35:50.000Z","comments":true,"path":"2017/01/28/2016年度技术总结/","link":"","permalink":"http://yoursite.com/2017/01/28/2016年度技术总结/","excerpt":"导语 时光荏苒，岁月如梭，不知不觉，我的大学生涯已经过半，马上就要迈出大学这座象牙塔，踏入那向往已久的社会闯荡，故总结一番这一年以来的点点滴滴，与己共勉。","text":"导语 时光荏苒，岁月如梭，不知不觉，我的大学生涯已经过半，马上就要迈出大学这座象牙塔，踏入那向往已久的社会闯荡，故总结一番这一年以来的点点滴滴，与己共勉。 主体内容 一、设计篇 设计篇の PS 番① PS的介绍Adobe Photoshop，简称“PS”，是由Adobe Systems开发和发行的图像处理软件。Photoshop主要处理以像素所构成的数字图像。使用其众多的编修与绘图工具，可以有效地进行图片编辑工作。ps有很多功能，在图像、图形、文字、视频、出版等各方面都有涉及。2003年，Adobe Photoshop 8被更名为Adobe Photoshop CS。2013年7月，Adobe公司推出了新版本的Photoshop CC，自此，Photoshop CS6作为Adobe CS系列的最后一个版本被新的CC系列取代。截止2016年12月Adobe PhotoshopCC2017为市场最新版本。Adobe支持Windows操作系统 、安卓系统与Mac OS， 但Linux操作系统用户可以通过使用Wine来运行Photoshop。② PS的历史1987年，Photoshop的主要设计师托马斯·诺尔买了一台苹果计算机（MacPlus）用来帮助他的博士论文。与此同时，Thomas发现当时的苹果计算机无法显示带灰度的黑白图像，因此他自己写了一个程序Display；而他兄弟约翰·诺尔这时在导演乔治·卢卡斯的电影特殊效果制作公司Industry Light Magic工作，对Thomas的程序很感兴趣。两兄弟在此后的一年多把Display不断修改为功能更为强大的图像编辑程序，经过多次改名后，在一个展会上接受了一个参展观众的建议，把程序改名为Photoshop。此时的Display/Photoshop已经有Level、色彩平衡、饱和度等调整。此外John写了一些程序，后来成为插件（Plug-in）的基础。他们第一个商业成功是把Photoshop交给一个扫描仪公司搭配卖，名字叫做Barneyscan XP，版本是0.87。与此同时John继续找其他买家，包括SuperMac和Aldus都没有成功。最终他们找到了Adobe的艺术总监Russell Brown。Russell Brown此时已经在研究是否考虑另外一家公司Letraset的ColorStudio图像编辑程序。看过Photoshop以后他认为Knoll兄弟的程序更有前途。在1988年7月他们口头决定合作，而真正的法律合同到次年4月才完成。在二十世纪90年代初美国的印刷工业发生了比较大的变化，印前（pre-press）电脑化开始普及。Photoshop在版本2.0增加的CMYK功能使得印刷厂开始把分色任务交给用户，一个新的行业桌上印刷（Desktop Publishing－DTP)由此产生。[1]至2015年2月19日，是AdobePhotoshop发布25周年纪念。③ PS的学习PS的学习相对而言还是比较枯燥的，基本全靠练，一大批一大批的作业量，虽然很累，但是确实学到了不少东西，先从最基本的工具开始讲起，接下来又利用各种案例去熟练掌握这些工具，最后利用学过的知识自己独立设计了一张海报作为考试题目。虽然学的很辛苦，但是在看到自己设计的海报一点一点成型的那种快乐的感觉也是棒极了。没有讲太多关于技术方面的问题，只是单纯的将自己在学习PS这门技术中的感想感受阐述了一些，技术性的问题，后期单独开一篇文章来说吧。 设计篇の AI 番① AI的介绍Adobe illustrator是一种应用于出版、多媒体和在线图像的工业标准矢量插画的软件，作为一款非常好的矢量图形处理工具，Adobe Illustrator广泛应用于印刷出版、海报书籍排版、专业插画、多媒体图像处理和互联网页面的制作等，也可以为线稿提供较高的精度和控制，适合生产任何小型设计到大型的复杂项目。② AI的历史前期Adobe Illustrator是Adobe系统公司推出的基于矢量的图形制作软件。最初是1986年为苹果公司麦金塔电脑设计开发的，1987年1月发布，在此之前它只是Adobe内部的字体开发和PostScript编辑软件。1987年，Adobe 公司推出了Adobe Illustrator1.1版本，其特征是包含一张录像带，内容是Adobe创始人约翰· 沃尔诺克对软件特征的宣传， 之后的一个版本称为 88版，因为发行时间是1988年。1988年，发布Adobe Illustrator1.9.5日文版 ，这个时期的Illustrator给人印象只是一个描图的工具。画面显示也不是很好。不过，令人欣喜的是它拥有曲线工具了。1988年，在Windows平台上推出了Adobe Illustrator2.0版本。Illustrator真正起步应该说是在1988年，Mac上推出的Illustrator 88版本。该版本是Illustrator的第一个视窗系统版本，但很不成功。1989年，在Mac上升级到Adobe Illustrator3.0版本，并在1991年移植到了Unix平台上。该版本注重加强了文本排版功能，包括“沿曲线排列文本”功能。也就在这时，Aldus公司开发了Mac系统版本的MacromediaFreeHand，拥有更简易的曲线功能和更复杂界面，带有渐变填充功能。之后FreeHand与Illustrator， PageMaker和QuarkXPress成为桌面出版商必备的”四大件”。而对于Illustrator，用户意见最大的“真混合渐变填充”功能直到多年以后的Illustrator5 中才得以实现。1990年发布，Adobe Illustrator3.2日文版，从这个版本开始文字终于可以转化为曲线了，ai被广泛普及于logo设计。1992年，发布了最早出现在PC平台上运行的Adobe Illustrator4.0版本，该版本也是最早的日文移植版本。该版本中 Illustrator第一次支持预览模式，由于该版本使用了Dan Clark的Anti-alias（抗锯齿显示）显示引擎，使得原本一直是锯齿的矢量图形在图形显示上有了质的飞跃。同时又在界面上做了重大的改革，风格和Photoshop极为相似，所以对于Adobe的老用户来说相当容易上手，也难怪没多久就风靡出版业，很快也推出了日文版。1992年，发布Adobe Illustrator5.0版本，该版本在西文的TrueType文字可以曲线化，日文汉字却不行，后期添加了Adobe Dimensions2.0J特性弥补了这一缺陷，可以通过它来转曲。1993年，发布Adobe Illustrator5.0日文版，Macintosh附带系统盘内的日文TrueType字体实现转曲功能。1994年，发布Adobe Illustrator5.5 ，加强了文字编辑的功能，显示出AI的强大魅力。1996年，发布Adobe Illustrator6.0，该版本在路径编辑上作了一些改变，主要是为了和Photoshop统一，但导致一些用户的不满，一直拒绝升级，Illustrator同时也开始支持TrueType字体，从而引发了PostScript Type 1 和TrueType之间的“字体大战”。。1997年，推出Adobe Illustrator7.0版本，同时在Mac和Windows平台推出，使麦金塔和视窗两个平台实现了相同功能，设计师们开始向 Illustrator靠拢，新功能有“变形面板”“对齐面板”“形状工具”等，并完善的PostScript页面描述语言，使得页面中的文字和图形的质量再次得到了飞跃，更凭借着她和Photoshop良好的互换性，赢得了很好的声誉，唯一遗憾的是7.0对中文的支持极差。1998年，发布Adobe Illustrator8.0，该版本的新功能有“动态混合”“笔刷”“渐变网络”等等，这个版本运行稳定，时隔多年的仍有广大用户使用。2000年，发布Adobe Illustrator 9.0，该版本的新功能有“透明效果”“保存Web格式”“外观”等，但是实际使用中透明功能却经常带来麻烦，导致很多用户仍使用版本8而不升级。2001年，发布Adobe Illustrator 10.0，是Mac OS 9上能运行的最高版本，主要新功能有“封套”(envelope)，“符号”(Symble)，“切片”等功能。切片功能的增加，使得可以将图形分割成小GIF，JEPG文件，明显是出于网络图像的支持。后期被纳入Creative Suite套装后不用数字编号，而改称CS版本，并同时拥有 Mac OS X 和 微软视窗操作系统两个版本。维纳斯的头像从Illustrator CS(实质版本号 11.0) 被更新为一朵艺术化的花朵，增加创意软件的自然效果。 CS版本新增功能有新的文本引擎（对OpenType的支持），“3D效果”等等。2002年，发布Adobe IllustratorCS。2003年，发布Adobe Illustrator CS2，即12.0版本，主要新增功能有“动态描摹”，“动态上色”，“控制面板”和自定义工作空间等等，在界面上和Photoshop等得到了统一。动态描摹可以将位图图像转化为矢量图型，动态上色可以让用户更灵活的给复杂对象区域上色。2007年，发布Adobe Illustrator CS3，新版本新增功能有“动态色彩面板”和与Flash的整合等等。另外，新增加裁剪，橡皮擦工具。2008年9月，发布Adobe Illustrator CS4，新版本新增斑点画笔工具、渐变透明效果、椭圆渐变，支持多个画板、显示渐变、面板内外观编辑、色盲人士工作区，多页输出、分色预览、出血支持以及用于Web、视频和移动的多个画板，CS4的启动界面仍以简约为主相对于CS3版本来说，橙黄变成了金黄的颜色AI的标志也成了半透明的黑色，给人一种凹陷下去的感觉。2010年，发布Adobe Illustrator CS5，件可以在透视中实现精准的绘图、创建宽度可变的描边、使用逼真的画笔上色，充分利用与新的Adobe CS Live在线服务的集成。AI CS5具有完全控制宽度可变、沿路径缩放的描边、箭头、虚线和艺术画笔。无需访问多个工具和面板，就可以在画板上直观地合并、编辑和填充形状。AI CS5 还能处理一个文件中最多 100 个不同大小的画板，并且按照愿组织和查看它们。2012年发行Adobe Illustrator CS6，软件包括新的 Adobe Mercury Performance System，该系统具有 Mac OS 和 Windows 的本地 64 位支持，可执行打开、保存和导出大文件以及预览复杂设计等任务。支持64位的好处是，软件可以有更大的内存支持，运算能力更强。还新增了不少功能和对原有的功能进行增强。全新的图像描摹，利用全新的描摹引擎将栅格图像转换为可编辑矢量。无需使用复杂控件即可获得清晰的线条、精确的拟合及可靠的结果。新增的高效、灵活的界面，借助简化的界面，减少完成日常任务所需的步骤。体验图层名称的内联编辑、精确的颜色取样以及可配合其他 Adobe 工具顺畅调节亮度的UI。还有高斯模糊增强功能、颜色面板增强功能、变换面板增强功能和控制面板增强功能等。2013年发布Illustor CC，Adobe Illustrator CC主要的改变包括：触控文字工具、以影像为笔刷、字体搜寻、同步设定、多个档案位置、CSS 摘取、同步色彩、区域和点状文字转换、用笔刷自动制作角位的样式和创作时自由转换。较快的速度和稳定性处理最复杂的图稿。全新的CC版本增加了可变宽度笔触、针对Web和移动的改进、增加了多个画板、触摸式创意工具等新鲜特性。使用全新的Illustrator CC你可以享用云端同步及快速分享你的设计！③ AI的功能Adobe illustrator作为全球最著名的矢量图形软件，以其强大的功能和体贴用户的界面，已经占据了全球矢量编辑 软件中的大部分份额。据不完全统计全球有37%的设计师在使用Adobe Illustrator进行艺术设计。尤其基于Adobe公司专利的PostScript技术的运用，Illustrator已经完全占领专业的印刷出版领域。无论是线稿的设计者和专业插画家、生产多媒体图像的艺术家、还是互联网页或在线内容的制作者，使用过Illustrator后都会发现，其强大的功能和简洁的界面设计风格只有Freehand能相比。软件特点最大特征在于钢笔工具的使用，使得操作简单功能强大的矢量绘图成为可能。[1] 它还集成文字处理、上色等功能，不仅在插图制作，在印刷制品（如广告传单、小册子）设计制作方面也广泛使用，事实上已经成为桌面出版（DTP）业界的默认标准。它的主要竞争对手是Macromedia Freehand；但是在2005年4月18日，Macromedia被Adobe公司收购。所谓的钢笔工具方法，在这个软件中就是通过“钢笔工具”设定“锚点”和“方向线”实现的。一般用户在一开始使用的时候都感到不太习惯，并需要一定练习；但是一旦掌握以后能够随心所欲绘制出各种线条，并直观可靠。它同时作为创意软件套装Creative Suite的重要组成部分，与兄弟软件——位图图形处理软件Photoshop有类似的界面，并能共享一些插件和功能，实现无缝连接。同时它也可以将文件输出为Flash格式。因此，可以通过illustrator让Adobe公司的产品与Flash连接。功能特性提供的工具它是一款专业图形设计工具，提供丰富的像素描绘功能以及顺畅灵活的矢量图编辑功能，能够快速创建设计工作流程。借助Expression Design，可以为屏幕/网页或打印产品创建复杂的设计和图形元素。 它支持许多矢量图形处理功能，拥有很多拥护者，也经历了时间的考验，因此人们不会随便就放弃它而选用微软的Expression Design。提供了一些相当典型的矢量图形工具，诸如三维原型（primitives）、多边形（polygons）和样条曲线（splines），一些常见的操作从这里都能被发现。特别的界面其外观颜色不同于Adobe的其他产品，Design是黑灰色或亮灰色外观，这种外观上改变或许是Adobe故意为之，意在告诉用户这是两个新产品，而不是原先产品的改进版。贝赛尔曲线的使用Adobe Illustrator最大特征在于贝赛尔曲线的使用，使得操作简单功能强大的矢量绘图成为可能。它还集成文字处理，上色等功能，不仅在插图制作，在印刷制品（如广告传单，小册子）设计制作方面也广泛使用，Macromedia Freehand，但是2005年Macromedia已经被Adobe公司合并。④ AI的学习说实话，AI这个软件确实很强大，虽然接触时间不长，但是这并不影响这门软件所能带给我们的强大的冲击力，强大图形设计能力使得众多设计师爱不释手，特别是在字体设计，矢量图形的设计上面，更是独得头筹，不过因为有着之前学习PS的经验，所以学起AI来也变得轻松了不少，AI的学习与PS的学习方式差距不大，都是靠实践去掌握每一个的工具，最后也同样使用AI这门软件做出了自己的作品，不得不说，学习，真的是一件值得坚持一辈子的事。 设计篇の 网页设计 番① 网页设计在将PS与AI这两门软件熟练掌握之后，我们开始学习网页设计，基础部分的概念讲解完之后，开始模仿电子商务类型的网站，网站设计中的banner图部分，更是重中之重，我们首先学习设计了banner图，接下来又讲解了一下网站设计的注意事项，最后经过一番实践之后，我们自己设计了一整套电子商务类型的网站。 二、代码篇 代码篇の HTML+CSS 番① HTMLHTML 是用来描述网页的一种语言。HTML 指的是超文本标记语言 (Hyper Text Markup Language)HTML 不是一种编程语言，而是一种标记语言 (markup language)标记语言是一套标记标签 (markup tag)HTML 使用标记标签来描述网页HTML 标签HTML 标记标签通常被称为 HTML 标签 (HTML tag)。HTML 标签是由尖括号包围的关键词HTML 标签通常是成对出现的标签对中的第一个标签是开始标签，第二个标签是结束标签开始和结束标签也被称为开放标签和闭合标签HTML 文档 = 网页HTML 文档描述网页HTML 文档包含 HTML 标签和纯文本HTML 文档也被称为网页Web 浏览器的作用是读取 HTML 文档，并以网页的形式显示出它们。浏览器不会显示 HTML 标签，而是使用标签来解释页面的内容。② CSSCSS 指层叠样式表 (Cascading Style Sheets)样式定义如何显示 HTML 元素样式通常存储在样式表中把样式添加到 HTML 4.0 中，是为了解决内容与表现分离的问题外部样式表可以极大提高工作效率外部样式表通常存储在 CSS 文件中多个样式定义可层叠为一 代码篇の JavaScript 番① JavaScriptJavaScript 是一种轻量级的编程语言。JavaScript 是可插入 HTML 页面的编程代码。JavaScript 插入 HTML 页面后，可由所有的现代浏览器执行。JavaScript 很容易学习。 ② JavaScript与Java的区别JavaScript 与 Java 是两种完全不同的语言，无论在概念还是设计上。Java（由 Sun 发明）是更复杂的编程语言。ECMA-262 是 JavaScript 标准的官方名称。JavaScript 由 Brendan Eich 发明。它于 1995 年出现在 Netscape （网景）中（该浏览器已停止更新），并于 1997 年被 ECMA（欧洲计算机制造商协会）采纳。 代码篇の jQuery 番① jQueryjavascript的一个库——作用：方便得到元素、设置样式、设置事件、动画jquery3.0不支持IE8.0及以下。对移动端进行了优化。名字中不允许出现中文和空格。可以用_$0-9a-zA-Z.JQuery是Prototype之后又一个优秀的JavaScript库。从 2005 年 8 月开始，进入公共开发阶段，随之而来的新框架于 2006 年 1 月 14 日正 式以 jQuery 的名称发布。JQuery的理念是写的少，做的多，优势：轻量级、强大的选择器、出色的DOM操作的封装、可靠的事件处理机制、完善的Ajax、出色的浏览器兼容性、链式操作方式等。 代码篇の HTML5+CSS3 番① HTML5支持度：IE9+ chrome FF o（奇虎360收购） safari包括所有的移动端（webkit内核—chrome、safari）学习要点：1、新表单元素2、新表单验证API3、多媒体处理（视频、音频） —— flash小游戏 游戏渲染4、Canvas 绘图工具（位图）5、拖拽6、Cookie的升级版 web存储7、离线定位② CSS3CSS3 被划分为模块。其中最重要的 CSS3 模块包括：选择器、框模型、背景和边框、文本效果、2D/3D转换、动画、多列布局、用户界面等。 代码篇の SVN+git 番① SVNSVN是Subversion的简称，是一个开放源代码的版本控制系统，相较于RCS、CVS，它采用了分支管理系统，它的设计目标就是取代CVS。互联网上很多版本控制服务已从CVS迁移到Subversion。说得简单一点SVN就是用于多个人共同开发同一个项目，共用资源的目的。② gitGit是一款免费、开源的分布式版本控制系统，用于敏捷高效地处理任何或小或大的项目。Git是一个开源的分布式版本控制系统，可以有效、高速的处理从很小到非常大的项目版本管理。Git 是 Linus Torvalds 为了帮助管理 Linux 内核开发而开发的一个开放源码的版本控制软件。Torvalds 开始着手开发 Git 是为了作为一种过渡方案来替代 BitKeeper，后者之前一直是 Linux 内核开发人员在全球使用的主要源代码工具。开放源码社区中的有些人觉得BitKeeper 的许可证并不适合开放源码社区的工作，因此 Torvalds 决定着手研究许可证更为灵活的版本控制系统。尽管最初 Git 的开发是为了辅助 Linux 内核开发的过程，但是我们已经发现在很多其他自由软件项目中也使用了 Git。例如 很多 Freedesktop 的项目迁移到了 Git 上。 代码篇の less 番① less动态样式语言LESS将CSS赋予了动态语言的特性：变量，继承，运算，函数LESS既可以在客户端上运行也可以借助Node.js或者Rhino在服务端运行 结语 此文章仅为大致总结，具体相关的技术会单独放在一篇文章中进行总结。","categories":[],"tags":[{"name":"前端工程师","slug":"前端工程师","permalink":"http://yoursite.com/tags/前端工程师/"},{"name":"技术总结","slug":"技术总结","permalink":"http://yoursite.com/tags/技术总结/"},{"name":"web","slug":"web","permalink":"http://yoursite.com/tags/web/"}]}]}